import React from 'react';

const Blog = () => {
      return (
        <div>
          <h1>What is context Api ?</h1>
          <p>
            React context Api হল একটি রিঅ্যাক্ট অ্যাপের জন্য কার্যকরভাবে গ্লোবাল
            ভেরিয়েবল তৈরি করার একটি উপায় যা চারপাশে পাস করা যেতে পারে। এটি
            "প্রপ ড্রিলিং" বা  দাদা-দাদি থেকে শিশু থেকে পিতা-মাতার কাছে প্রপস
            সরানোর বিকল্প। Redax ব্যবহার করে  পরিচালনার জন্য প্রসঙ্গটিকে
            একটি সহজ, হালকা পদ্ধতি হিসাবেও উল্লেখ করা হয়। কনটেক্সট এপিআই হল
            রিঅ্যাক্টের 16.3 সংস্করণে যোগ করা একটি নতুন বৈশিষ্ট্য যা একজনকে পুরো
            অ্যাপ জুড়ে হালকাভাবে এবং স্বাচ্ছন্দ্যে কাজ ভাগ করতে দেয়।
          </p>
          <h1>What is semantic tag ?</h1>
          <p>
            Semantic Tag যা কেবল
            উপস্থাপনার পরিবর্তে ওয়েব পৃষ্ঠার অর্থের পরিচয় দেয়। উদাহরণস্বরূপ,
            একটি (p) ট্যাগ নির্দেশ করে যে আবদ্ধ পাঠ্যটি একটি অনুচ্ছেদ। এটি
            শব্দার্থগত এবং উপস্থাপনাগত উভয়ই কারণ লোকেরা জানে অনুচ্ছেদগুলি কী
            এবং ব্রাউজারগুলি কীভাবে সেগুলি প্রদর্শন করতে হয় তা জানে৷ এই
            সমীকরণের উল্টো দিকে, ট্যাগ যেমন (b) এবং (i) Semantic tag নয়। তারা
            শুধুমাত্র টেক্সট দেখতে কেমন হওয়া উচিত তা নির্ধারণ করে , এবং মার্কআপে কোন অতিরিক্ত অর্থ প্রদান করে না।
          </p>
        </div>
      );
};

export default Blog;